read_verilog -sv @V_FILES_STR@

hierarchy -check -top @TOP_MODULE@

proc; opt; fsm; opt; memory; opt
clean

stat -top @TOP_MODULE@

write_verilog @V_GEN@
